Repository: AposVinc/GymPortalPWA
Catalog: src/locale/messages.*.xlf
Languages: it

# HomePage-Title
source: Regions
it: Regioni

# Header-Registration
source: Registration
it: Registrazione

# Header-Login
source: Login
it: Accedi

# Header-Profile
source: Profile
it: Profilo

# Button-Logout
source: Logout
it: Esci

# Form-LabelName
source: Name
it: Nome

# Form-LabelLastname
source: Lastname
it: Cognome

# Button-Register
source: Register
it: Registrati

# Form-ErrorName
source: Invalid field
it: Campo non valido

# Form-ErrorLastname
source: Invalid field
it: Campo non valido

# Form-ErrorEmail
source: Invalid field
it: Campo non valido

# Form-ErrorUsername
source: Invalid field
it: Campo non valido

# Form-ErrorPassword
source: Length between 5 and 10 characters
it: Lunghezza tra 5 e 10 caratteri

# Button-Login
source: Login
it: Accedi

# ProfilePage-ProfileSection
source: Profile
it: Profilo

# ProfilePage-UpdateSection
source: Update
it: Aggiorna

# ProfilePage-TitleFavoritesGymSection
source: Favorite gyms
it: Palestre Favorite

# ProfilePage-SubtitleFavoritesGymSection
source: In this section are shown the gyms that you have chosen to mark as favorites by clicking on the heart button
it: In questa sezione vengono mostrate le palestre che hai scelto di segnare come preferite cliccando sul bottone a forma di cuore

# ProfilePage-TitleFavoritesCourseSection
source: Favorite courses
it: Corsi Preferiti

# ProfilePage-SubtitleFavoritesCourseSection
source: In this section are shown the courses of the gyms you have chosen to mark as your favorites by clicking on the heart button
it: In questa sezione vengono mostrate i corsi che hai scelto di segnare come preferiti cliccando sul bottone a forma di cuore

# ProfilePage-TitleFeedbacksGymSection
source: Gyms reviews
it: Recensioni per le palestre

# ProfilePage-SubtitleFeedbacksGymSection
source: This section shows your reviews that you have written for gyms
it: In questa sezione sono mostrate le tue recensioni che hai scritto per le palestre

# ProfilePage-TitleFeedbacksCourseSection
source: Courses reviews
it: Recensioni per i corsi

# ProfilePage-SubtitleFeedbacksCourseSection
source: This section shows your reviews that you have written for courses
it: In questa sezione sono mostrate le tue recensioni che hai scritto per i corsi

# FeedbacksComponent-ProfileTitleCourse
source: Course: "\uFFFD0\uFFFD"
it: Corso: "\uFFFD0\uFFFD"

# FeedbacksComponent-Rating
source: Rating: "\uFFFD0\uFFFD"
it: Voto: "\uFFFD0\uFFFD"

# FeedbacksComponent-ProfileTitleGym
source: Gym: "\uFFFD0\uFFFD"
it: Palestra: "\uFFFD0\uFFFD"

# LinkButton-RemoveFavorite
source: Remove Favorite
it: Rimuovi Favorito

# CardProfileComponent-Title
source: "\uFFFD0\uFFFD" "\uFFFD1\uFFFD"'s profile
it: Profilo di "\uFFFD0\uFFFD" "\uFFFD1\uFFFD"

# Button-Update
source: Update
it: Aggiorna

# AdminHomePage-Title
source: Administration
it: Amministrazione

# AdminHomePage-Subtitle
source: Area reserved for gym managers, here you can add your gyms and courses associated with them
it: Area riservata ai gestori di palestre, qui puoi aggiungere le tue palestre e i corsi ad esse associati

# AdminHomePage-TitleAddGym
source: Add Gym
it: Aggiungi Palestra

# AdminHomePage-TitleAddCourse
source: Add Course
it: Aggiungi Corso

# AdminHomePage-TitleDeleteGym
source: Delete Gym
it: Elimina Plaestra

# AdminHomePage-TitleDeleteCourse
source: Delete Course
it: Elimina Corso

# GymsPage-Subtitle
source: Welcome to the "\uFFFD0\uFFFD"'s gyms
it: Benvenuti nelle palestre della regione "\uFFFD0\uFFFD"

# Form-LabelRegion
source: Region
it: Regione

# Form-SelectRegion
source: --- Select Region ----
it: --- Scegli Regone ----

# Form-LabelGym
source: Gym
it: Palestra

# Form-SelectGym
source: --- Select Gym ----
it: --- Seleziona Palestra ----

# Form-LabelCourse
source: Course
it: Corso

# Form-SelectCourse
source: --- Select Course ----
it: --- Seleziona Corso ----

# Button-Delete
source: Delete
it: Elimina

# Form-SuccessCourseDelete
source: Course Deleted
it: Corso Eliminato

# Form-ErrorCourseDelete
source: An error has occurred.
it: Si è verificato un errore.

# Form-SuccessGymDelete
source: Gym Deleted
it: Palestra Eliminata

# Form-ErrorGymDelete
source: An error has occurred. Delete first the gym's courses
it: Si è verificato un errore. Cancella prima i corsi della palestra

# AdminLoginForm-Title
source: Reserved Area
it: Area Riservata

# Form-ErrorAuthentication
source: An authentication error has occurred.
it: Si è verificato un errore nell'autenticazione

# Form-LabelCode
source: Code
it: Codice

# Form-LabelDescription
source: Description
it: Descrizione

# Button-Add
source: Add
it: Aggiungi

# Form-SuccessCourseAdd
source: Course Added
it: Corso Aggiunto

# Form-ErrorCourseAdd
source: An error has occurred.
it: Si è verificato un errore.

# Form-LabelProvince
source: Province
it: Provincia

# Form-LabelAddress
source: Address
it: Indirizzo

# Form-SuccessGymAdd
source: Gym Added
it: Palestra Aggiunta

# Form-ErrorGymAdd
source: An error has occurred.
it: Si è verificato un errore.

# AddFeedbackCoursePage-Title
source: Add Review
it: Aggiungi Recensione

# AddFeedbackCoursePage-Subtitle
source: Add review to course "\uFFFD0\uFFFD"
it: Aggiungi una recensione al corso "\uFFFD0\uFFFD"

# AddFeedbackGymPage-Title
source: Add Review
it: Aggiungi Recensione

# AddFeedbackGymPage-Subtitle
source: Add review to gym "\uFFFD0\uFFFD"
it: Aggiungi una recensione alla palestra "\uFFFD0\uFFFD"

# FeedbacksCoursePage-FeedbacksTitle
source: Reviews
it: Recensione

# FeedbacksCoursePage-FeedbacksSubtitle
source: Reviews on the course "\uFFFD0\uFFFD"
it: Recensioni del corso "\uFFFD0\uFFFD"

# CoursesPage-GymSubtitle
source: Welcome to the "\uFFFD0\uFFFD"'s courses
it: Benvenuto nei corsi della palestra "\uFFFD0\uFFFD"

# CoursesPage-FeedbacksTitle
source: Reviews
it: Recensioni

# CoursesPage-FeedbacksSubtitle
source: Reviews on the gym "\uFFFD0\uFFFD"
it: Recensioni della palestra "\uFFFD0\uFFFD"

# FeedbackComponent-FeedLabel
source: Feed
it: Recensione

# FeedbackComponent-RatingLabel
source: Rating
it: Voto

# FeedbackComponent-ErrorFeed
source: Invalid field
it: Campo non valido

# FeedbackComponent-ErrorRating
source: Invalid field
it: Campo non valido

# Button-Edit
source: Edit
it: Modifica

# LinkButton-EditReview
source: Edit Review
it: Modifica Recensione

# LinkButton-DeleteReview
source: Delete Review
it: Elimina Recensione

# FeedbacksComponent-NoFeedbacksGymTitle
source: There are no reviews for this gym
it: Non ci sono delle recensioni per questa palestra

# FeedbacksComponent-NoFeedbacksGymSubtitle
source: What are you waiting for?! You can be the first!!!
it: Cosa stai aspettando? Puoi essere il primo!!!

# FeedbacksComponent-NoFeedbacksCourseTitle
source: There are no reviews for this course
it: Non ci sono delle recensioni per questo corso

# FeedbacksComponent-NoFeedbaksCourseSubtitle
source: What are you waiting for?! You can be the first!!!
it: Cosa stai aspettando? Puoi essere il primo!!!

# LinkButton-ViewsReview
source: Views Reviews
it: Vedi le recensioni

# LinkButton-AddReview
source: Add Review
it: Aggiungi Recensione

# LinkButton-AddFavorite
source: Add Favorite
it: Aggiungi Favorito

# CourseCardComponent-NoCoursesTitle
source: There are no courses
it: Non ci sono corsi

# CourseCardComponent-NoCoursesSubtitle
source: Unfortunately we don't have any courses for this gym on our site yet, we will try to fix that soon!!!
it: Purtroppo non abbiamo ancora nessun corso per questa palestra sul nostro sito, cercheremo di rimediare presto!!!

# GymCardComponent-NoGymsTitle
source: There are no courses
it: Non ci sono corsi

# GymCardComponent-NoGymsSubtitle
source: Unfortunately we don't have any gym affiliated to our site for this region yet, we will try to solve it as soon as possible!
it: Purtroppo non abbiamo ancora nessuna palestra affiliata al nostro sito per questa regione, cercheremo di risolvere il problema il prima possibile!
